In [9]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [7]:
pd.DataFrame("that is not time visible".split(),"i1 i2 i3 i4 i5".split(),"c1".split())

         c1
i1     that
i2       is
i3      not
i4     time
i5  visible

In [16]:
df=pd.DataFrame(randn(3,3),["a","b","c"],["x","y","z"])
df

          x         y         z
a  1.528032 -1.154825  1.556565
b -1.171111  0.054869  1.013225
c  0.422330 -0.687380 -0.001775

In [23]:
df.loc["a"]  #row

x    1.528032
y   -1.154825
z    1.556565
Name: a, dtype: float64

In [24]:
df["x"]["a"]

1.5280322341290027

In [27]:
df.loc["a"]["x"]

1.5280322341290027

In [29]:
df.reset_index()

  index         x         y         z
0     a  1.528032 -1.154825  1.556565
1     b -1.171111  0.054869  1.013225
2     c  0.422330 -0.687380 -0.001775

In [33]:
df.iloc[0]["x"]

1.5280322341290027

In [61]:
df["new"]=(df["x"]+df["y"])/2

In [36]:
df

          x         y         z       new
a  1.528032 -1.154825  1.556565  0.186604
b -1.171111  0.054869  1.013225 -0.558121
c  0.422330 -0.687380 -0.001775 -0.132525

In [47]:
df["index"]=np.arange(3)

In [48]:
df

              x         y         z       new  index
index
0      1.528032 -1.154825  1.556565  0.186604      0
1     -1.171111  0.054869  1.013225 -0.558121      1
2      0.422330 -0.687380 -0.001775 -0.132525      2

In [51]:
df.set_index("index",inplace=True)

In [62]:
df

              x         y         z       new
index
0      1.528032 -1.154825  1.556565  0.186604
1     -1.171111  0.054869  1.013225 -0.558121
2      0.422330 -0.687380 -0.001775 -0.132525

In [63]:
df.drop("new",axis=1)

              x         y         z
index
0      1.528032 -1.154825  1.556565
1     -1.171111  0.054869  1.013225
2      0.422330 -0.687380 -0.001775

In [60]:
df

              x         y         z
index
0      1.528032 -1.154825  1.556565
1     -1.171111  0.054869  1.013225
2      0.422330 -0.687380 -0.001775

In [64]:
df.drop("new",axis=1,inplace=True)

In [68]:
df

              x         y         z
index
0      1.528032 -1.154825  1.556565
1     -1.171111  0.054869  1.013225
2      0.422330 -0.687380 -0.001775

In [70]:
df[["y","z"]]

              y         z
index
0     -1.154825  1.556565
1      0.054869  1.013225
2     -0.687380 -0.001775

In [72]:
df[["y","z"]].loc[[1,2]]

              y         z
index
1      0.054869  1.013225
2     -0.687380 -0.001775

In [74]:
df.loc[[1,2],["x","z"]]

              x         z
index
1     -1.171111  1.013225
2      0.422330 -0.001775

In [75]:
df

              x         y         z
index
0      1.528032 -1.154825  1.556565
1     -1.171111  0.054869  1.013225
2      0.422330 -0.687380 -0.001775

In [76]:
df>0

           x      y      z
index
0       True  False   True
1      False   True   True
2       True  False  False

In [78]:
df[df>0]

              x         y         z
index
0      1.528032       NaN  1.556565
1           NaN  0.054869  1.013225
2      0.422330       NaN       NaN

In [80]:
df[df["x"]>0]

              x         y         z
index
0      1.528032 -1.154825  1.556565
2      0.422330 -0.687380 -0.001775

In [81]:
df["x"]>0

index
0     True
1    False
2     True
Name: x, dtype: bool

In [85]:
df[df["x"]>0][["y","x"]]

              y         x
index
0     -1.154825  1.528032
2     -0.687380  0.422330

In [89]:
df[df["x"]>0][["y","x"]].loc[2,"x"]

0.4223304573314144

In [91]:
df

              x         y         z
index
0      1.528032 -1.154825  1.556565
1     -1.171111  0.054869  1.013225
2      0.422330 -0.687380 -0.001775

In [93]:
df[(df["x"]>0) & (df["x"]<1)]["x"][2]

0.4223304573314144

In [113]:
df[(df.loc[[0,1,2]]<0) | (df.loc[[0,1,2]]<1)]

              x         y         z
index
0           NaN -1.154825       NaN
1     -1.171111  0.054869       NaN
2      0.422330 -0.687380 -0.001775

In [134]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [129]:
hier_indexs = [["Sem1","C"],["Sem1","javascript"],["Sem1","HTML/CSS"],["Sem2","Data Structures"],["Sem2","C++"],["Sem2","COA"]]
# hier_indexs
hier_indexs=pd.MultiIndex.from_arrays(hier_indexs)
hier_indexs

MultiIndex([('Sem1',       'Sem1',     'Sem1',            'Sem2', 'Sem2', ...),
            (   'C', 'javascript', 'HTML/CSS', 'Data Structures',  'C++', ...)],
           )

In [133]:
pd.DataFrame(np.random.randn(2,2),index=hier_indexs,columns=["A","B"])

                                                          A         B
Sem1 Sem1       Sem1     Sem2            Sem2 Sem2  0.20771 -2.754750
C    javascript HTML/CSS Data Structures C++  COA  -0.65675  1.121328

In [138]:
df=pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=["A","B"])
df

             A         B
G1 1 -1.998758 -0.940626
   2  0.468082  0.115466
   3  0.001245  1.640467
G2 1  0.023505  0.107628
   2 -1.265719  0.736841
   3 -0.034146 -0.866902

In [143]:
df.xs(1,level=1)

           A         B
G1 -1.998758 -0.940626
G2  0.023505  0.107628

In [148]:
df.xs("G1")

          A         B
1 -1.998758 -0.940626
2  0.468082  0.115466
3  0.001245  1.640467

In [150]:
df.xs("G1",level=0)

          A         B
1 -1.998758 -0.940626
2  0.468082  0.115466
3  0.001245  1.640467